import pandas as pd

data = {
    '이름' : ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교' : ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}
df = pd.DataFrame(data, index=['1번', '2번', '3번', '4번', '5번', '6번', '7번', '8번'])
df.index.name = '학번'

# 컬럼 선택
print(df[['이름', '키']])

# 정수 index로 컬럼 선택
print(df[df.columns[0]]) # df['이름']과 동일하게 동작

# 맨 마지막 컬럼 선택
print(df[df.columns[-1]])

# 슬라이싱
print(df[3:])

# 0~4 까지 영어 점수 데이터
print(df['영어'][0:5])

# 처음 3명의 이름, 키
print(df[['이름', '키']][:3])
