import pandas as pd

data = {
    '이름' : ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교' : ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}
df = pd.DataFrame(data, index=['1번', '2번', '3번', '4번', '5번', '6번', '7번', '8번'])
df.index.name = '학번'

# 해당 조건의 여부를 True/False로 출력
print(df['키'] >= 185)

# 필터링
df_filter = (df['키'] >= 185)
print(df[df_filter])

# 필터를 역으로(not) 적용
print(df[~df_filter])

# 필터 바로 적용
print(df[df['키'] >= 185])

# 키가 185이상인 학생들의 수학 데이터
print(df.loc[df['키'] >= 185, '수학'])

print(df.loc[df['키'] >= 185, ['이름', '수학', '과학']])


# 다양한 조건
# & 그리고(and)
# 키가 185 이상인 북산고 학생
print(df.loc[(df['키'] >= 185) & (df['학교'] == '북산고')])

# | 또는(or)
# 키가 170보다 작거나 200보다 큰 학생
print(df.loc[(df['키'] < 170) | (df['키'] > 200)])
